---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.BentFabricSheetLinesOverlapOrIntersect
source: html/fb2f8c18-a13c-fee5-ed32-247709674e7e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.BentFabricSheetLinesOverlapOrIntersect Property

Segments in a bend profile cannot overlap, intersect, or be collinearly contiguous. Click Continue to correct the profile or Click Quit sketching to exit the bend profile editor.

## Syntax (C#)
```csharp
public static FailureDefinitionId BentFabricSheetLinesOverlapOrIntersect { get; }
```